In [75]:
import pandas as pd

In [76]:
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['Aammar', 'Amaar', 'Hamza', 'Hazma'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}
# make pandas dataframe
df = pd.DataFrame(data)

In [77]:
df.head()

         date        country    name  sales_2020  sales_2021
0  2021-12-01            USA  Aammar       100.0         NaN
1  01-12-2022         U.S.A.   Amaar       200.0       150.0
2  2022/12/01        America   Hamza         NaN       300.0
3  12-01-2021  United States   Hazma       200.0       150.0

In [ ]:
# Standardizing the data format
df['date_parsed'] = pd.to_datetime(df['date'], errors="coerce")

df.loc[df['date_parsed'].isna(), 'date_parsed'] = pd.to_datetime(
    df.loc[df['date_parsed'].isna(), 'date'],
    errors='coerce',
    dayfirst=True
)

df['date'] = df['date_parsed'].dt.strftime('%y-%m-%d')

df.drop(columns=['date_parsed'], inplace=True)

df['date'] = df['date'].fillna(method='ffill')
print(df)

       date        country    name  sales_2020  sales_2021
0  21-12-01            USA  Aammar       100.0         NaN
1  22-12-01         U.S.A.   Amaar       200.0       150.0
2  22-12-01        America   Hamza         NaN       300.0
3  21-01-12  United States   Hazma       200.0       150.0

C:\Users\Dell\AppData\Local\Temp\ipykernel_6260\2537483279.py:10: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['date'] = df['date'].fillna(method='ffill')

In [79]:
# Harmonize the name of the country
country_mapping = {'USA': 'United States', 'U.S.A.':'United States', 'America' : 'United States'}
df['country'] = df['country'].replace(country_mapping)
df.head()

       date        country    name  sales_2020  sales_2021
0  21-12-01  United States  Aammar       100.0         NaN
1  22-12-01  United States   Amaar       200.0       150.0
2  22-12-01  United States   Hamza         NaN       300.0
3  21-01-12  United States   Hazma       200.0       150.0

In [80]:
# Correct the typographical mistakes in name
df['name'] = df['name'].replace({'Amaar' : 'Aammar', 'Hazma': 'Hamza'})
df.head()

       date        country    name  sales_2020  sales_2021
0  21-12-01  United States  Aammar       100.0         NaN
1  22-12-01  United States  Aammar       200.0       150.0
2  22-12-01  United States   Hamza         NaN       300.0
3  21-01-12  United States   Hamza       200.0       150.0

In [81]:
# remove duplicates
df = df.drop_duplicates(subset='name')
df.head()

       date        country    name  sales_2020  sales_2021
0  21-12-01  United States  Aammar       100.0         NaN
2  22-12-01  United States   Hamza         NaN       300.0

In [82]:
df.head()

       date        country    name  sales_2020  sales_2021
0  21-12-01  United States  Aammar       100.0         NaN
2  22-12-01  United States   Hamza         NaN       300.0

In [83]:
# 5. Resolving Contradictory data
# For demonstration, let's assume sales_2021 should always higher than sales_2020
# We'll remove rows where this condition is not met
df = df.drop(df[df['sales_2021'] <= df['sales_2020']].index)
df.head()

       date        country    name  sales_2020  sales_2021
0  21-12-01  United States  Aammar       100.0         NaN
2  22-12-01  United States   Hamza         NaN       300.0